do
 function run(msg, matches)
local text = [[ 
Ø§Ø² Ø®Ø¯Ù…Ø§Øª Ø§Ù… ØªÛŒ Ø§Ù† Ø§ÛŒØ±Ø§Ù†Ø³Ù„ Ø¨Ù‡Ø±Ù‡ Ù…Ù†Ø¯ Ø´ÙˆÛŒØ¯:

Ø³Ø±ÙˆÛŒØ³ Ø§Ø³ØªØ¹Ù„Ø§Ù… Ù…ÙˆØ¬ÙˆØ¯ÛŒ:
Ø´Ù…Ø§ Ù…ÛŒ ØªÙˆØ§Ù†ÛŒØ¯ Ø¨Ø§ Ø´Ù…Ø§Ø±Ù‡ Ú¯ÛŒØ±ÛŒ *Û±Û´Û±*Û±#[YES/OK]  Ø§Ø² Ù…ÙˆØ¬ÙˆØ¯ÛŒ Ø­Ø³Ø§Ø¨ Ø®ÙˆØ¯ Ø¢Ú¯Ø§Ù‡ Ø´ÙˆÛŒØ¯.

Ø®Ø¯Ù…Ø§Øª Ù…Ø´ØªØ±Ú©Ø§Ù† Ø§Ù… ØªÛŒ Ø§Ù† Ø§ÛŒØ±Ø§Ù†Ø³Ù„:
ÛŒÚ© Ø®Ø· ØªÙ„ÙÙ†ÛŒ Ø¨Ø±Ø§ÛŒ Ø§Ø±Ø§Ø¦Ù‡ Ú©Ù…Ú© Ùˆ Ù¾Ø´ØªÛŒØ¨Ø§Ù†ÛŒ Ú©Ù‡ Ø¨Ù‡ Ø´Ù…Ø§ Ø§Ù…Ú©Ø§Ù† Ø¯Ø³ØªØ±Ø³ÛŒ ÙÙˆØ±ÛŒ Ø¨Ù‡ ØªÛŒÙ… Ø®Ø¯Ù…Ø§Øª Ù…Ø´ØªØ±Ú©Ø§Ù† Ø§Ù… ØªÛŒ Ø§Ù† Ø§ÛŒØ±Ø§Ù†Ø³Ù„ Ø±Ø§ Ù…ÛŒ Ø¯Ù‡Ø¯. ÙÙ‚Ø· Ú©Ø§ÙÛŒØ³Øª Ø¨Ø§ Û·Û°Û° ØªÙ…Ø§Ø³ Ø¨Ú¯ÛŒØ±ÛŒØ¯.

Ú©Ù†ØªØ±Ù„ Ø­Ø³Ø§Ø¨ Ø§ÛŒÙ†ØªØ±Ù†ØªÛŒ (E-Care):
Ø´Ù…Ø§ Ù…ÛŒØªÙˆØ§Ù†ÛŒØ¯ Ø¨Ø§ Ø§Ø±Ø³Ø§Ù„ Ú©Ù„Ù…Ù‡ E-Care Ø¨Ù‡ Ø´Ù…Ø§Ø±Ù‡ Û±Û³Û° Ø§Ø² Ø·Ø±ÛŒÙ‚ Ù¾ÛŒØ§Ù… Ú©ÙˆØªØ§Ù‡ØŒ Ø¨Ø·ÙˆØ± Ø±Ø§ÛŒÚ¯Ø§Ù† Ø¨Ø±Ø§ÛŒ Ø³Ø±ÙˆÛŒØ³ Ú©Ù†ØªØ±Ù„ Ø­Ø³Ø§Ø¨ Ø§ÛŒÙ†ØªØ±Ù†ØªÛŒ Ø«Ø¨Øª Ù†Ø§Ù… Ù†Ù…ÙˆØ¯Ù‡ Ùˆ Ø§Ø² Ø¬Ø²Ø¦ÛŒØ§Øª Ù…Ú©Ø§Ù„Ù…Ø§Øª Ø®ÙˆØ¯ Ø¢Ú¯Ø§Ù‡ Ø´ÙˆÛŒØ¯.

Ù¾ÛŒØ§Ù…Ù‡Ø§ÛŒ Ù†ÙˆØ´ØªØ§Ø±ÛŒ: Ø®Ø¯Ù…Ø§Øª Ù¾ÛŒØ§Ù… Ú©ÙˆØªØ§Ù‡ (SMS)
Ø³Ø±ÙˆÛŒØ³ Ù¾ÛŒØ§Ù… Ú©ÙˆØªØ§Ù‡ Ø¨Ù‡ Ø´Ù…Ø§ Ø§Ø¬Ø§Ø²Ù‡ Ù…ÛŒ Ø¯Ù‡Ø¯ ØªØ§ Ù¾ÛŒØ§Ù…Ù‡Ø§ÛŒ Ù†ÙˆØ´ØªØ§Ø±ÛŒ Ø±Ø§ Ø¨Ù‡ Ø³Ø§ÛŒØ± Ú©Ø§Ø±Ø¨Ø±Ø§Ù† ØªÙ„ÙÙ† Ù‡Ù…Ø±Ø§Ù‡ Ø§Ø±Ø³Ø§Ù„ Ùˆ ÛŒØ§ Ø§Ø² Ø¢Ù†Ù‡Ø§ Ø¯Ø±ÛŒØ§ÙØª Ù†Ù…Ø§Ø¦ÛŒØ¯. Ù¾ÛŒØ§Ù…Ù‡Ø§ÛŒ Ù†ÙˆØ´ØªØ§Ø±ÛŒ Ø´Ù…Ø§ Ù…ÛŒ ØªÙˆØ§Ù†Ù†Ø¯ Ø­Ø¯Ø§Ú©Ø«Ø± Ù…Ø¹Ø§Ø¯Ù„ Û±Û¶Û° Ø­Ø±Ù ÛŒØ§ Ø±Ù‚Ù… (Ø´Ø§Ù…Ù„ ÙÙˆØ§ØµÙ„ Ø¨ÛŒÙ† Ø¢Ù†Ù‡Ø§) Ø¨Ù‡ Ø²Ø¨Ø§Ù† Ø§Ù†Ú¯Ù„ÛŒØ³ÛŒ Ùˆ ÛŒØ§ Û·Û° Ø­Ø±Ù ÛŒØ§ Ø±Ù‚Ù… (Ø´Ø§Ù…Ù„ ÙÙˆØ§ØµÙ„ Ø¨ÛŒÙ† Ø¢Ù†Ù‡Ø§) Ø¨Ù‡ Ø²Ø¨Ø§Ù† ÙØ§Ø±Ø³ÛŒ Ø¨Ø§Ø´Ù†Ø¯. Ø¨Ø±Ø§ÛŒ ÙØ±Ø³ØªØ§Ø¯Ù† SMS Ø§Ø² ØµØ­Øª Ø´Ù…Ø§Ø±Ù‡ Ù…Ø±Ú©Ø² Ù¾ÛŒØ§Ù… Ø§Ø·Ù…ÛŒÙ†Ø§Ù† Ø­Ø§ØµÙ„ ÙØ±Ù…Ø§ÛŒÛŒØ¯. Ø´Ù…Ø§Ø±Ù‡ Ù…Ø±Ú©Ø² Ù¾ÛŒØ§Ù… Û°Û°Û¹Û¸Û¹Û³ÛµÛ°Û°Û°Û±Û´Û°Û° Ù…ÛŒ Ø¨Ø§Ø´Ø¯.

Ø§Ù†ØªÙ‚Ø§Ù„ ØªÙ…Ø§Ø³ ØªÙ„ÙÙ†ÛŒ:
Ø´Ù…Ø§ Ù…ÛŒ ØªÙˆØ§Ù†ÛŒØ¯ ØªÙ…Ø§Ø³Ù‡Ø§ÛŒ Ø®ÙˆØ¯ Ø±Ø§ Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ø§ÛŒÙ† Ø³Ø±ÙˆÛŒØ³ Ø¨Ù‡ Ù‡Ø± Ø´Ù…Ø§Ø±Ù‡ ØªÙ„ÙÙ† Ø¯ÛŒÚ¯Ø±ÛŒ Ø¨Ø¬Ø² ØªÙ„ÙÙ† Ù‡Ù…Ø±Ø§Ù‡ Ø®ÙˆØ¯ Ù…Ù†ØªÙ‚Ù„ Ú©Ù†ÛŒØ¯. Ù‡Ù…Ú†Ù†ÛŒÙ† Ù…ÛŒ ØªÙˆØ§Ù†ÛŒØ¯ Ø§Ù†ØªÙ‚Ø§Ù„ ØªÙ…Ø§Ø³ Ø±Ø§ Ø¨Ø±Ø§ÛŒ Ø­Ø§Ù„Øª Ù‡Ø§ÛŒ Ù…Ø®ØªÙ„Ù (Ø¹Ø¯Ù… Ø¯Ø³ØªØ±Ø³ÛŒØŒ Ø§Ø´ØºØ§Ù„ Ø¨ÙˆØ¯Ù†ØŒ Ø¹Ø¯Ù… Ù¾Ø§Ø³Ø®Ú¯ÙˆÛŒÛŒ Ùˆ ÛŒØ§ Ø§Ù†ØªÙ‚Ø§Ù„ Ø¯Ø§Ø¦Ù…ÛŒ ) ØªÙ†Ø¸ÛŒÙ… Ú©Ù†ÛŒØ¯.

Ú©Ù†ÙØ±Ø§Ù†Ø³ ØªÙ„ÙÙ†ÛŒ:
 Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ø§ÛŒÙ† Ø³Ø±ÙˆÛŒØ³ Ù…ÛŒ ØªÙˆØ§Ù†ÛŒØ¯ Ø¨Ø·ÙˆØ± Ù‡Ù…Ø²Ù…Ø§Ù† Ø¨Ø§ Ø­Ø¯Ø§Ú©Ø«Ø± Ù¾Ù†Ø¬ Ù†ÙØ± Ø¯ÛŒÚ¯Ø± ØµØ­Ø¨Øª Ú©Ù†ÛŒØ¯. Ù…Ù‡Ù… Ù†ÛŒØ³Øª Ú©Ù‡ Ø§ÛŒÙ† Ø§ÙØ±Ø§Ø¯ Ø¯Ø± Ú©Ø¯Ø§Ù… Ø´Ù‡Ø±/Ù…Ù†Ø·Ù‚Ù‡ Ù‡Ø³ØªÙ†Ø¯ Ùˆ ÛŒØ§ Ø§Ø² Ú†Ù‡ Ø´Ø¨Ú©Ù‡ Ù…Ø®Ø§Ø¨Ø±Ø§ØªÛŒ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù…ÛŒâ€ŒÙ†Ù…Ø§ÛŒÙ†Ø¯.

Ø³Ø±ÙˆÛŒØ³ Ø´Ù†Ø§Ø³Ø§ÛŒÛŒ ØªÙ…Ø§Ø³ Ú¯ÛŒØ±Ù†Ø¯Ù‡ (CLIP):
Ø§ÛŒÙ† Ø³Ø±ÙˆÛŒØ³ Ø¨Ù‡ Ø´Ù…Ø§ Ø§Ù…Ú©Ø§Ù† Ù…ÛŒ Ø¯Ù‡Ø¯ ØªØ§ Ù‚Ø¨Ù„ Ø§Ø² Ù¾Ø§Ø³Ø® Ø¯Ø§Ø¯Ù† Ø¨Ù‡ ØªÙ„ÙÙ† Ù‡Ù…Ø±Ø§Ù‡ØªØ§Ù†ØŒ Ø´Ù…Ø§Ø±Ù‡ Ø´Ø®Øµ ØªÙ…Ø§Ø³ Ú¯ÛŒØ±Ù†Ø¯Ù‡ Ø±Ø§ Ø¨Ø¨ÛŒÙ†ÛŒØ¯.

ØªÙ…Ø§Ø³ Ø¨ÛŒÙ† Ø§Ù„Ù…Ù„Ù„ÛŒ:
Ø¨Ø§ Ù‡Ø± Ú©Ø³ÛŒ Ø¯Ø± Ù‡Ø± Ø¬Ø§ÛŒ Ø¯Ù†ÛŒØ§ Ú©Ù‡ Ø¨Ø§Ø´ÛŒØ¯ Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² ØªÙ„ÙÙ† Ù‡Ù…Ø±Ø§Ù‡ØªØ§Ù† ØªÙ…Ø§Ø³ Ø¨Ú¯ÛŒØ±ÛŒØ¯. Ú©Ø§ÙÛŒØ³Øª Ø§Ø² Ø¯Ø§Ø´ØªÙ† Ø§Ø¹ØªØ¨Ø§Ø± Ú©Ø§ÙÛŒ Ùˆ Ú©Ø¯ Ø¨ÛŒÙ† Ø§Ù„Ù…Ù„Ù„ÛŒ ØµØ­ÛŒØ­ Ø§Ø·Ù…ÛŒÙ†Ø§Ù† Ø­Ø§ØµÙ„ ÙØ±Ù…Ø§ÛŒÛŒØ¯.
__________________________________
Ø¨Ø±Ø§ÛŒ Ø¯Ø±ÛŒØ§ÙØª Ø§Ø·Ù„Ø§Ø¹Ø§Øª Ú©Ø§Ù…Ù„ ØªØ± Ø¨Ù‡
irancell.ir
Ø³Ø± Ø¨Ø²Ù†ÛŒØ¯
_________________________________
]]
return text
end
return {
patterns = {
"^([Ii]rancell)$",
"^[!/#](irancell)$",
"^(Ø§ÛŒØ±Ø§Ù†Ø³Ù„$",
},
run = run
}
end
